added updated readme file
